Repository: Tapiokansleri/help-me-choose-wp
Catalog: languages/auta-minua-valitsemaan-*.po
Languages: fi

source: Settings saved.
fi: Asetukset tallennettu.

source: Steps Configuration
fi: Vaiheiden konfigurointi

source: Configure the steps of your decision tree. Each option can have a target step - when selected, it will jump to that specific step. If no target is set, it will go to the next sequential step. The recommendation will be shown after the last step.
fi: Määritä päätöspuun vaiheet. Jokaisella vaihtoehdolla voi olla kohdevaihe - kun se valitaan, siirrytään kyseiseen vaiheeseen. Jos kohdetta ei ole asetettu, siirrytään seuraavaan peräkkäiseen vaiheeseen. Suositus näytetään viimeisen vaiheen jälkeen.

source: Expand All
fi: Laajenna kaikki

source: Collapse All
fi: Sulje kaikki

source: Add Step
fi: Lisää vaihe

source: Recommendations
fi: Suositukset

source: Define the recommendation that will be shown after completing all steps. Only one recommendation will be displayed.
fi: Määritä suositus, joka näytetään kaikkien vaiheiden suorittamisen jälkeen. Vain yksi suositus näytetään.

source: Add Recommendation
fi: Lisää suositus

source: Save Configuration
fi: Tallenna konfiguraatio

source: Step
fi: Vaihe

source: Remove
fi: Poista

source: Step Title
fi: Vaiheen otsikko

source: Enter step title
fi: Syötä vaiheen otsikko

source: Options
fi: Vaihtoehdot

source: Add Option
fi: Lisää vaihtoehto

source: Add Image
fi: Lisää kuva

source: Remove Image
fi: Poista kuva

source: Option label
fi: Vaihtoehdon teksti

source: Next Step (Sequential)
fi: Seuraava vaihe (peräkkäinen)

source: Jump to Recommendation
fi: Siirry suosituksiin

source: Recommendations:
fi: Suositukset:

source: No recommendations configured yet.
fi: Suosituksia ei ole vielä määritelty.

source: Recommendation Title
fi: Suosituksen otsikko

source: Content Type
fi: Sisällön tyyppi

source: Plain Text
fi: Pelkkä teksti

source: Select Content
fi: Valitse sisältö

source: Search...
fi: Etsi...

source: Clear
fi: Tyhjennä

source: Content
fi: Sisältö

source: Recommendation content
fi: Suosituksen sisältö

source: You do not have sufficient permissions to access this page.
fi: Sinulla ei ole riittäviä oikeuksia käyttää tätä sivua.

source: Please configure the form in Tools → Help me choose
fi: Ole hyvä ja määritä lomake Työkalut → Help me choose

source: Please enter a search term
fi: Ole hyvä ja syötä hakusana

source: Invalid post ID
fi: Virheellinen artikkelin tunniste

source: Post not found
fi: Artikkelia ei löytynyt

source: Read more
fi: Lue lisää

source: Buy
fi: Osta

source: Target Step
fi: Kohdevaihe

source: No results found
fi: Tuloksia ei löytynyt

source: Select Image
fi: Valitse kuva

source: Use this image
fi: Käytä tätä kuvaa

source: Loading...
fi: Ladataan...

source: Error loading content
fi: Virhe sisällön latauksessa

source: Reset Form
fi: Nollaa lomake

source: Styling Options
fi: Tyyliasetukset

source: Customize the appearance of your decision tree form.
fi: Mukauta päätöspuun lomakkeen ulkoasua.

source: Step Styling
fi: Vaiheen tyylit

source: Enable Borders
fi: Ota reunat käyttöön

source: Show borders on steps
fi: Näytä reunat vaiheissa

source: Border Color
fi: Reunan väri

source: Border Width (px)
fi: Reunan leveys (px)

source: Border Radius (px)
fi: Reunan pyöristys (px)

source: Background Color
fi: Taustaväri

source: Text Color
fi: Tekstin väri

source: Padding (px)
fi: Sisennys (px)

source: Option Card Styling
fi: Vaihtoehtokortin tyylit

source: Show borders on option cards
fi: Näytä reunat vaihtoehtokorteissa

source: Hover Background Color
fi: Hover-taustaväri

source: Image Settings
fi: Kuvan asetukset

source: Option Image Size (px)
fi: Vaihtoehdon kuvan koko (px)

source: Maximum width/height for option images
fi: Vaihtoehtokuvien maksimileveys/korkeus

source: Container Styling
fi: Säiliön tyylit

source: Width
fi: Leveys

source: Container width (default: 100%)
fi: Säiliön leveys (oletus: 100%)

source: Container padding (default: 0)
fi: Säiliön sisennys (oletus: 0)

source: Steps
fi: Vaiheet

source: Styling
fi: Tyylit

source: Statistics
fi: Tilastot

source: Usage Statistics
fi: Käyttötilastot

source: View statistics about how users interact with your decision tree tool.
fi: Näytä tilastot siitä, miten käyttäjät käyttävät päätöspuutyökalua.

source: Total Users
fi: Käyttäjät yhteensä

source: Unique users who have used the tool
fi: Yksilölliset käyttäjät, jotka ovat käyttäneet työkalua

source: Completed
fi: Valmistuneet

source: %s%% completion rate
fi: %s%% valmistumisaste

source: Abandoned
fi: Keskeytetyt

source: %s%% abandonment rate
fi: %s%% keskeytysaste

source: In Progress
fi: Käynnissä

source: Users currently using the tool
fi: Käyttäjät, jotka käyttävät työkalua tällä hetkellä

source: Database table not found. Please deactivate and reactivate the plugin to create it.
fi: Tietokantataulua ei löydy. Poista ja aktivoi lisäosa uudelleen luodaksesi sen.

source: Create Table Now
fi: Luo taulu nyt

source: Permission denied
fi: Käyttöoikeus evätty

source: Table created successfully
fi: Taulu luotiin onnistuneesti

source: Settings
fi: Asetukset

source: Shortcode
fi: Lyhytkoodi

source: Configure plugin settings and options.
fi: Määritä lisäosan asetukset ja vaihtoehdot.

source: Enable Tracking
fi: Ota seuranta käyttöön

source: Track user interactions and statistics
fi: Seuraa käyttäjien vuorovaikutuksia ja tilastoja

source: When disabled, no user data will be tracked or stored.
fi: Kun poistettu käytöstä, käyttäjien tietoja ei seurata tai tallenneta.

source: Show Debug Information
fi: Näytä debug-tiedot

source: Display debug information on the frontend (admin only)
fi: Näytä debug-tiedot etusivulla (vain ylläpitäjille)

source: When enabled, logged-in administrators will see debug information at the bottom of the form.
fi: Kun käytössä, kirjautuneet ylläpitäjät näkevät debug-tiedot lomakkeen alaosassa.

source: Danger Zone
fi: Vaaravyöhyke

source: Reset all tracking data. This action cannot be undone!
fi: Nollaa kaikki seurantatiedot. Tätä toimintoa ei voi perua!

source: Reset Database
fi: Nollaa tietokanta

source: Database reset successfully
fi: Tietokanta nollattiin onnistuneesti

source: Failed to reset database
fi: Tietokannan nollaus epäonnistui

source: Step Description
fi: Vaiheen kuvaus

source: Enter step description (optional)
fi: Syötä vaiheen kuvaus (valinnainen)

source: Optional text that appears under the step title
fi: Valinnainen teksti, joka näkyy vaiheen otsikon alla

source: Option description (optional)
fi: Vaihtoehdon kuvaus (valinnainen)

source: Use this shortcode to display the decision tree form on any page or post.
fi: Käytä tätä lyhytkoodia näyttääksesi päätöspuulomakkeen millä tahansa sivulla tai artikkelissa.

source: Copy
fi: Kopioi

source: Shortcode copied to clipboard!
fi: Lyhytkoodi kopioitu leikepöydälle!

source: Paste this shortcode into any page or post where you want to display the decision tree form.
fi: Liitä tämä lyhytkoodi mihin tahansa sivulle tai artikkeliin, jossa haluat näyttää päätöspuulomakkeen.

source: Debug Information (Admin Only)
fi: Debug-tiedot (vain ylläpitäjille)

source: Description
fi: Kuvaus

source: Recommendation description (supports shortcodes)
fi: Suosituksen kuvaus (tukee lyhytkoodeja)

source: Optional description text for this recommendation bundle. You can use shortcodes here.
fi: Valinnainen kuvaus teksti tälle suosituspaketille. Voit käyttää lyhytkoodeja täällä.

source: Select Content Items
fi: Valitse sisältökohteet

source: -- Select Post Type --
fi: -- Valitse artikkelityyppi --

source: Search for pages, products, or posts...
fi: Etsi sivuja, tuotteita tai artikkeleita...

source: Selected Items:
fi: Valitut kohteet:

source: No items selected. Search and add items above.
fi: Kohteita ei ole valittu. Etsi ja lisää kohteita yllä.

source: Search and select multiple pages, products, or posts to include in this recommendation bundle.
fi: Etsi ja valitse useita sivuja, tuotteita tai artikkeleita sisällytettäväksi tähän suosituspakettiin.

source: -- Select Target Step --
fi: -- Valitse kohdevaihe --

source: Option "%s" in step "%s" must have a target step selected.
fi: Vaihtoehdon "%s" vaiheessa "%s" on valittava kohdevaihe.

source: Option "%s" in step "%s" jumps to recommendation but no recommendations are selected. Please select at least one recommendation.
fi: Vaihtoehto "%s" vaiheessa "%s" siirtyy suosituksiin, mutta yhtään suositusta ei ole valittu. Valitse vähintään yksi suositus.

source: Import / Export Configuration
fi: Tuo / Vie konfiguraatio

source: Export your steps and recommendations configuration as JSON, or import a previously exported configuration.
fi: Vie vaiheet ja suositukset JSON-muodossa tai tuo aiemmin viedyt konfiguraatiot.

source: Export Configuration
fi: Vie konfiguraatio

source: Export Configuration as JSON
fi: Vie konfiguraatio JSON-muodossa

source: Download your current steps and recommendations configuration as a JSON file.
fi: Lataa nykyiset vaiheet ja suositukset JSON-tiedostona.

source: Import Configuration
fi: Tuo konfiguraatio

source: Paste JSON configuration here...
fi: Liitä JSON-konfiguraatio tähän...

source: Paste a JSON configuration exported from this plugin. This will replace your current configuration.
fi: Liitä tästä lisäosasta viedyt JSON-konfiguraatiot. Tämä korvaa nykyisen konfiguraatiosi.

source: Exporting...
fi: Viedään...

source: Configuration exported successfully!
fi: Konfiguraatio viety onnistuneesti!

source: Failed to export configuration.
fi: Konfiguraation vienti epäonnistui.

source: Importing...
fi: Tuodaan...

source: Configuration imported successfully!
fi: Konfiguraatio tuotu onnistuneesti!

source: Failed to import configuration.
fi: Konfiguraation tuonti epäonnistui.

source: Please paste JSON configuration data.
fi: Liitä JSON-konfiguraatiotiedot.

source: This will replace your current configuration. Are you sure?
fi: Tämä korvaa nykyisen konfiguraatiosi. Oletko varma?

source: Steps imported:
fi: Tuodut vaiheet:

source: Recommendations imported:
fi: Tuodut suositukset:

source: Generate Starter Pack
fi: Luo aloituspaketti

source: Generate Starter Pack JSON
fi: Luo aloituspaketti JSON

source: Generate a JSON file containing all pages, posts, custom post types, and products (if WooCommerce is installed) from your website. This can be used by AI tools to generate decision tree configurations.
fi: Luo JSON-tiedosto, joka sisältää kaikki sivut, artikkelit, mukautetut artikkelityypit ja tuotteet (jos WooCommerce on asennettuna) verkkosivustoltasi. Tätä voidaan käyttää AI-työkaluissa päätöspuukonfiguraatioiden luomiseen.

source: Generating...
fi: Luodaan...

source: Starter pack generated successfully!
fi: Aloituspaketti luotu onnistuneesti!

source: Failed to generate starter pack.
fi: Aloituspaketin luonti epäonnistui.

source: Installation Wizard
fi: Asennusohjattu

source: Follow these simple steps to set up your decision tree with AI assistance.
fi: Seuraa näitä yksinkertaisia vaiheita asentaaksesi päätöspuusi AI-avulla.

source: Download a JSON file containing all your pages, posts, custom post types, products, and menu structure.
fi: Lataa JSON-tiedosto, joka sisältää kaikki sivusi, artikkelisi, mukautetut artikkelityypit, tuotteet ja valikkorakenteen.

source: Starter pack generated!
fi: Aloituspaketti luotu!

source: Upload to AI Tool
fi: Lataa AI-työkaluun

source: Open the AI configuration generator and upload your starter pack file. The tool will analyze your website and generate a decision tree configuration.
fi: Avaa AI-konfiguraatiogeneraattori ja lataa aloituspakkisi. Työkalu analysoi verkkosivustosi ja luo päätöspuukonfiguraation.

source: Open AI Configuration Generator
fi: Avaa AI-konfiguraatiogeneraattori

source: After uploading your starter pack, copy the generated JSON configuration.
fi: Kun olet ladannut aloituspakkisi, kopioi generoitu JSON-konfiguraatio.

source: Paste Generated JSON
fi: Liitä generoitu JSON

source: Paste the JSON configuration generated by the AI tool below.
fi: Liitä alla olevaan kenttään AI-työkalun generoima JSON-konfiguraatio.

source: Voila!
fi: Valmis!

source: Your decision tree is now configured! You can customize it further in the Steps and Recommendations tabs.
fi: Päätöspuusi on nyt konfiguroitu! Voit muokata sitä edelleen Vaiheet- ja Suositukset-välilehdillä.

source: Go to Steps
fi: Siirry vaiheisiin

source: Go to Recommendations
fi: Siirry suosituksiin

source: Results Settings
fi: Tulosten asetukset

source: Excerpt Length (characters)
fi: Tiivistelmän pituus (merkkejä)

source: Maximum number of characters for recommendation excerpts (0 = no limit)
fi: Suosituskorttien tiivistelmien maksimipituus merkkeinä (0 = ei rajaa)

source: What to Show
fi: Mitä näytetään

source: Show Title
fi: Näytä otsikko

source: Show Image
fi: Näytä kuva

source: Show Excerpt
fi: Näytä tiivistelmä

source: Select which elements to display in recommendation cards
fi: Valitse mitkä elementit näytetään suosituskorteissa

source: has been activated!
fi: on aktivoitu!

source: Get started quickly with our
fi: Aloita nopeasti

source: or
fi: tai

source: configure manually
fi: määritä manuaalisesti

source: Style Preset
fi: Tyylivalmiste

source: Style 1
fi: Tyyli 1

source: Style 2
fi: Tyyli 2

source: Style 3
fi: Tyyli 3

source: Custom
fi: Mukautettu

source: Select a preset style or choose Custom to modify individual styling options.
fi: Valitse valmiste-tyyli tai valitse Mukautettu muokataksesi yksittäisiä tyyliasetuksia.
